const noDBTexts = {
    'beauty': ['Как совмещать работу, личную жизнь, отдых и развлечения мы не знаем. Однако мы точно поможем' +
    ' совмещать это с красотой! 💃 \n\nУложим и накрасим самые непослушные брови так, что на время ты сможешь совсем' +
    ' забыть про коррекцию 😉 \n\nНе загрузим график даже самой занятой бизнес-леди, а запись в директе заберет' +
    ' у тебя всего несколько секунд!', 'Увлажнение кожи на руках неотъемлемая' +
    ' часть ежедневного ухода за собой.\n\nИногда увлажняющих кремов недостаточно, кутикулаи кожа вокруг ногтя сухие,' +
    ' появляются заусенцы \n\nМастер по маникюру уберет огрубевшую кожу и сострижет кутикулу, а значит о проблеме можно' +
    ' на время забыть 😉 \n\nДля сохранения эффекта можно дома смазывать зону вокруг ногтя оливковым, кокосовым,' +
    ' либо смесью различных масел,которые не только сохранят кожу увлажненной,но и укрепят ногти ✨', 'Нас погода на ' +
    'улице не радует не меньше вашего... \n\nНо при этом в нашей студии солнечно круглый год! Заходи зарядиться теплом от ' +
    'душевных мастеров, чья забота о твоих волосах улучшит настроение надолго 🧘 \n\nПеред укладкой волосы обязательно ' +
    'моются в теплой воде, а после тщательно сушатся теплющим феном,так что прогреем тебя 100 процентов💆'],
    'psych': ['Как прочитать собеседника 📖\n' +
    '⠀\n' +
    'При общении с человеком, как правило, трудно понять, какие на самом деле эмоции тот испытывает при разговоре. Особенно если речь о деловом диалоге.\n' +
    '⠀\n' +
    'Существует множество способов "чтения" собеседника. Я расскажу про самые надежные среди них:\n' +
    '⠀\n' +
    '🔹Поставьте себя на место человека.\n' +
    'Как бы банально это ни звучало, в нестандартных ситуациях это самый надежный способ понять, что чувствует собеседник.\n' +
    '⠀\n' +
    '🔹 Важны не слова человека, а то, как он их говорит.\n' +
    'Оговорки, повторение фраз, бегающий взгляд, такие мелочи многое говорят о настроении и намерениях собеседника\n' +
    '⠀\n' +
    '🔹Походка.\n' +
    'Ровная походка с прямой головой свидетельствует об уверенности человека. Скрытный собеседник будет прятать руки в карманы. Человек, который не намерен уступать, не станет подстраиваться под чужой темп ходьбы и будет двигать собеседника к краю дороги\n' +
    '⠀\n' +
    '🔹Позы.\n' +
    'Анализ поз - известный способ чтения собеседника. Положение рук или ног, открытость позы, на все это следует обращать внимание\n' +
    '⠀\n' +
    'Однако наша интуиция лучше всего справляется с чтением людей. Умение чувствовать окружающих присуще далеко не каждому, но если вы обладаете этим качеством, цените это 😌\n' +
    '⠀\n' +
    'Насколько развита ваша интуиция?', '6 типов психологической защиты.\n' +
    '⠀\n' +
    'Посещение психолога не приносит результатов чаще всего по вине пациента. Человеку не помочь, если он отрицает проблему и не хочет меняться, но такие клиенты обычно не доходят до врача. Проблема постоянных посетителей психолога обычно в другом.\n' +
    '⠀\n' +
    'Психологическая защита.\n' +
    '⠀\n' +
    'Пациенты выстраивают барьеры при общении с психологом, которые не дают составить полную картину проблемы. Пациент не осознает, что сам тормозит процесс и сваливает ответственность на психолога.\n' +
    '⠀\n' +
    'Вот некоторые барьеры, которые замедляют лечение:\n' +
    '⠀\n' +
    '1️⃣ Подавление негативных воспоминаний в памяти,\n' +
    '⠀\n' +
    '2️⃣ Создание ложных воспоминаний, смягчающих воспоминания о прошлом,\n' +
    '⠀\n' +
    '3️⃣ Отрицание очевидных фактов,\n' +
    '⠀\n' +
    '4️⃣ Перенос ответственности за неудачи на других,\n' +
    '⠀\n' +
    '5️⃣ Присвоение собственных мыслей и чувств другим людям,\n' +
    '⠀\n' +
    '6️⃣ Отказ решать проблему при возникновении, ожидание, что ее решат другие.\n' +
    '⠀\n' +
    'Если вы часто используете перечисленные механизмы защиты, скорее всего вы передаете психологу неполную информацию о вашем состоянии.', 'Почему сила воли не виновата в неудачах❓\n' +
    '⠀\n' +
    'Скажи, кто твой друг, и я скажу, кто ты. Все знают эту поговорку, но немногие пользуется этим принципом для улучшения качества жизни.\n' +
    '⠀\n' +
    'Неудачников обвиняют в лени и отсутствии силы воли. Принцип "Возьми и начни делать" считается панацеей от бедности. Однако тут все не так просто 👩‍🏫\n' +
    '⠀\n' +
    'Зачем человеку меняться, если вокруг него люди, которым и так нормально? \n' +
    '\n' +
    'Конечно, единицы выбиваются и добиваются успеха. Как правило, такие люди вовремя осознают, что надо отказаться от окружения, которое не тянет их выше ↗️\n' +
    '⠀\n' +
    'Доказано, что при наличии полного друга мотивации худеть у человека не будет. Так и с карьерой, если вокруг талантливые и успешные люди, человек невольно тянется за ними.\n' +
    '⠀\n' +
    'Прежде чем включать силу воли, необходимо осознать пагубное влияние окружения на жизнь. Это самый сложный этап, но без него невозможны кардинальные изменения.\n' +
    '⠀\n' +
    'Есть ли в вашем окружении примеры для подражания?', 'Трипваер. Как использовать для продвижения\n' +
    '\n' +
    'У блогеров, предпринимателей, да у всех, кто имеет отношение к продажам, помимо основного продукта всегда есть маленький, ознакомительный. Речь о трипваере, который по сути является недорогой версией большого продукта\n' +
    '\n' +
    'Трипваер важно иметь при работе в инфо-сфере. Если вам удастся впечатлить клиента экспертностью, наполнением мини-версии вебинара, курса, чего угодно, то велика вероятность возвращения его за покупкой главного продукта.\n' +
    '\n' +
    'Такой прием подогревает аудиторию, доводит ее дальше по воронке продаж.\n' +
    '\n' +
    'Психологу каждый постоянный клиент приносит большую прибыль, но добывается кровью и потом. Если у вас проблемы с поиском клиентов, я крайне рекомендую ввести в практику недорогие консультации через мессенджеры.\n' +
    '\n' +
    'Полноценная консультация по WhatsApp или Telegram звучит странно, понимаю. Но подумайте, вы знакомитесь с клиентом, он узнает поближе вас. Появляется возможность продумать каждый ответ, обработать в спокойном режиме возражения. Если человек согласился на такую консультацию, скорее всего он окажется заинтересован в оффлайн терапии.\n' +
    '\n' +
    'Какие вы видите сложности в подобной консультации?', 'Кто мешает стать лучшим в любимом деле?\n' +
    ' \n' +
    'В неудачах можно винить обстоятельства, недостаток таланта, окружающих, себя. Однако причина часто кроется в неправильном подходе к собственным ошибкам.\n' +
    ' \n' +
    'Что вы чувствуете, когда что-то не получается? Когда изучили теорию, знаете все об опыте людей, которые добились высот, когда чем больше стараетесь, тем больше неудачных попыток получаете? Скорее всего, вы начинаете обдумывать тактику, каждый шаг до мелочей, сравниваете себя с другими. Тогда и включается ваш Внутренний Критик.\n' +
    ' \n' +
    'Успешный человек точно не даст рецепта богатства и уверенности. Потому что не знает, почему добился высот. «Я просто занимался своим делом, на этом все.» Именно это вы услышите от бизнесменов, управляющих компаниями, чемпионов.\n' +
    ' \n' +
    'Как получить такое же везение и доверие к собственной судьбе?\n' +
    ' \n' +
    'Выключите Внутреннего Критика. \n' +
    '\n' +
    'Перестаньте обдумывать каждый шаг. Вы даже не заметите, как начнется рост. Доверившись интуиции, вы научитесь поступать так, как нужно, а ошибки начнете воспринимать как полезный опыт. Без доверия интуиции не найти правильной стратегии при принятии карьерных или жизненных решений, невозможно кайфовать от того, чем занимаешься.\n' +
    ' \n' +
    'При этом важно сломать установку, что только усердный труд приведет к желаемому. Знаю, это сложно, этому нас учили с детства. Детские установки сломать труднее всего. Наверняка вы слышали про «синдром отличника», когда живя усердным трудом и перфекционизмом, люди в конце концов ломались, когда сталкивались с вполне естественными ошибками и неудачами.\n' +
    ' \n' +
    'Будьте проще, относитесь к себе менее строго, доверяйте интуиции. Не забывайте, что любая оценка собственных действий необъективна и находится исключительно в вашей голове. А негатив, который вы в себе вынашиваете, в конце концов может сбыться из-за самовнушения.\n' +
    ' \n' +
    'Узнали ли вы в себе Внутреннего Критика?', 'Какой Лид-магнит выбрать психологу.\n' +
    '\n' +
    'Для привлечения постоянных клиентов необходимо показать и доказать экспертность. Если вы подписаны хоть на одного инфо-блогера, то могли заметить, как они любят раздавать подарки в виде бесплатных гайдов или чек-листов.\n' +
    '\n' +
    'Для получения подарка нужно оставить почту, номер телефона, подписку. Именно так работает лид-магнит. Вы получаете небольшой продукт и знакомитесь с блогером, блогер получает лид. Вы сами того не подозревая попадаете в продуманную воронку продаж.\n' +
    '\n' +
    'Как психологу использовать лид-магниты в продвижении? Бесплатная консультация. Предлагайте бесплатную консультацию за целевое действие. Так вы сразу получите разогретую аудиторию, поскольку познакомите подписчиков с собой лично.\n' +
    '\n' +
    'На консультации, как вариант, предложите выслушать одну актуальную проблему подписчика. Дайте размышления о ней, задавайте уточняющие вопросы. Объясните, как регулярные консультации с вами приведут к решению проблемы.\n' +
    '\n' +
    'Стоит обратить внимание на личную консультацию, поскольку остальные инфопродукты обезличены, не знакомят с методикой, не располагают к себе потенциального клиента.\n' +
    '\n' +
    'Не бойтесь давать клиенту, пусть даже потенциальному, больше, чем он ожидает. Конкуренция настолько высока, что выделиться можно только честным, искренним отношениям к аудитории. Бесплатные консультации на 10 минут покажут, что вам не плевать на проблемы подписчиков, что к вам всегда можно обратиться за помощью.\n' +
    '\n' +
    'Пишите в комментарии, какие еще идеи для привлечения лидов вы бы использовали в продвижении?'],
    'business': ['Топ-5 ошибок рекрутеров.\n' +
    '⠀\n' +
    'Как показать работодателю, что вы непрофессиональный hr-специалист?  Следуйте следующей инструкции! ✔️\n' +
    '⠀\n' +
    '\n' +
    '🔸После договоренности о собеседовании не давайте кандидату адрес офиса, не говорите как правильно проехать и в какую дверь зайти.\n' +
    '⠀\n' +
    '\n' +
    '🔸Если человек все же нашел нужный кабинет, выдайте ему огромную анкету на заполнение. Желательно чтобы половина пунктов дублировала вопросы, на которые есть ответы в резюме.\n' +
    '⠀\n' +
    '\n' +
    '🔸Проводите стрессовое интервью без положительного завершения. Пусть кандидат сформирует негативное мнение о вас и компании.\n' +
    '⠀\n' +
    '\n' +
    '🔸Спасибо, мы вам перезвоним. Тут без комментариев.\n' +
    '⠀\n' +
    '\n' +
    'Если кандидат понравился, сразу закрывайте вакансию и отменяйте следующие собеседования.\n' +
    '⠀\n' +
    'Очень надеюсь, что вы не узнали себя в этих пунктах. Перечисленные ошибки непростительны даже для начинающих рекрутеров 😡', 'Зачем нужно делегирование 💼\n' +
    '⠀\n' +
    'Рабочий день близится к концу, половина сотрудников уже ушла домой, а вы в одиночку справляетесь с катастрофой в бизнесе и проклинаете восьмичасовой рабочий день ⛈\n' +
    '⠀\n' +
    'Если вам знакома эта ситуация, значит вы взяли на себя слишком много задач и вам срочно нужно передать их другим специалистам\n' +
    '⠀\n' +
    'Когда руководитель контролирует все мелочи, обязательно страдает его стратегическая и творческая деятельность. Решая отправить ли Артема в отпуск и сколько потратить на корпоративные подарки, руководитель не успевает придумать как обойти конкурентов и увеличить прибыль компании.\n' +
    '⠀\n' +
    'Какие задачи можно и нужно делегировать? 🗂\n' +
    '⠀\n' +
    'Главное правило: не давайте поручения, а передавайте идею и принимайте итоговое решение. Например, в случае подготовки рекламной акции, не надо придумывать слоганы, рисовать баннеры и так далее, чтобы передать это потом в отдел маркетинга. Поручите эти задачи дизайнеру, заместителю, пусть рекламный отдел креативит с рекламой, а не вы.\n' +
    '⠀\n' +
    'Вы можете смело делегировать административные, финансовые и стратегические дела, чтобы заниматься действительно важными вещами. Обучайте приближенных тому, что умеете только вы, и вмешивайтесь только в случаях возникновения конфликтов\n' +
    '⠀\n' +
    'Благодаря делегированию, вы сможете посмотреть на работу бизнеса в целом, вам станут понятны пробелы и недочеты стратегии, что точно пойдет на пользу фирме.\n' +
    '⠀\n' +
    'Готовы ли вы делегировать свои задачи сотрудникам?', 'Почему конфликтуют отделы продаж и маркетинга 🤯\n' +
    '⠀\n' +
    'Отделы преследуют разные цели, но без слаженной работы возникает ряд серьезных проблем, от снижения продаж до потери потенциальных клиентов. 😱\n' +
    '⠀\n' +
    'Если маркетологи не взаимодействуют с продажниками и не учитывают интересы друг друга при построении стратегии, возникает первая стадия конфликта отделов. 🙅‍♂\n' +
    '⠀\n' +
    'Маркетологи получают бонусы только за привлеченных клиентов, им не важно, совершат ли они дальше покупку. Рано или поздно наступает момент, когда продажники не справляются с потоком привлеченных клиентов и продолжают работать по старой схеме.\n' +
    '⠀\n' +
    'Точка кипения наступает тогда, когда маркетологи посылают длительное время неподготовленных клиентов, сбрасывая их обработку на продажников.\n' +
    '⠀\n' +
    'Руководителю важно в самом начале урегурировать взаимодействие этих двух отделов. Как минимум, наладив коммуникации между отделами. В идеале нужно поставить промежуточные цели при привлечении клиента для покупки товара. ☝️\n' +
    '⠀\n' +
    'Расскажите, насколько эта проблема вам знакома?', 'ПЛЮСЫ И МИНУСЫ УДАЛЕННОЙ РАБОТЫ\n' +
    '\n' +
    'При мыслях о фрилансе многие представляют себе работу на мальдивах, когда бизнесмен работает на лежаке с ноутбуком, попивая коктейли🌅\n' +
    '\n' +
    'На деле же ноутбук и пляж несовместимы, потому что песок неизбежно попадает в разъемы, а аккумуляторы не выдерживают жары. Как и у всего, у фриланса есть свои достоинства и недостатки. Сегодня я расскажу про все стороны удаленной работы.\n' +
    '\n' +
    'МИНУСЫ\n' +
    '\n' +
    '➖ Непостоянность прибыли\n' +
    'В одном месяце фрилансер заработал 50 тысяч, в следующем 200, а в третьем снова 50. Такие скачки нормальное дело из-за сезонности заказов. К примеру, в сентябре заказчики только отправили детей в школу и у них мало денег, чтобы нанять удаленщика, а в конце года предприятия тратят оставшийся бюджет и заказов много.\n' +
    '\n' +
    '➖ Космические суммы \n' +
    'Переходя на фриланс, многие ожидают, что при минимальных энергозатратах можно получать в разы больше, чем в офисе. На самом деле "выстреливает" лишь малый процент фрилансеров.\n' +
    '\n' +
    '➖ Самоорганизация \n' +
    'На работу мы едем, потому что надо. Когда человек на фрилансе, за ним никто не следит, кроме него самого. Постепенно фрилансер приходит к тому, что надо вставать рано, как на работу, составлять расписание и выполнять план. \n' +
    '\n' +
    '➖ Работа без выходных\n' +
    'Желая освободиться от офиса, фрилансер сталкивается с ситуацией, когда приходится работать и в праздники, и на дне рождении подруги, и в воскресенье утром.\n' +
    '\n' +
    'ПЛЮСЫ\n' +
    '\n' +
    '➕ Свобода\n' +
    'Вы вольны делать то, что нравится. Найдя занятие по душе появятся и заказы, потому что заказчики чувствуют, когда что-то сделано с любовью.\n' +
    '\n' +
    '➕ Меньше стресса\n' +
    'При офисной работе мы нервничаем не только из-за криков начальника, но и из-за общественного транспорта, пробок и множества других факторов.\n' +
    '\n' +
    '➕ Отпуск без разрешения\n' +
    'Накопив достаточно денег на фрилансе, можно спокойно уйти в отпуск когда угодно и на любой срок. Можно ловить сезоны, когда на дорогих курортах недорого и нет большого количества туристов\n' +
    '\n' +
    '➕ Возможность совмещать с учебой или основной работой.\n' +
    'Студенты часто не могут себе позволить даже работу со свободным графиком, потому что нагрузка по учебе может быть непредсказуема, а на работу приходить все равно нужно. На фрилансе такой проблемы нет, от работы всегда можно оторваться на учебу и наоборот.\n' +
    '\n' +
    '➕ Возможность работать в любимом месте.\n' +
    'Намного приятнее работать не в душном офисе, а в любимом кафе или парке.  Перерыв в таком месте будет проходить не в курилке, а на прогулке.\n' +
    '\n' +
    'Удаленная работа имеет больше достоинств, именно поэтому это то, на что стоит обратить внимание при выборе профессии.\n' +
    '\n' +
    'А вы уже присоединились к рядам армии фрилансеров?💪'],
    'sales': ['ProRideSchool открывает сезон катания 🏂⛷\n' +
    '⠀\n' +
    'Давно собираешься научиться кататься на лыжах или сноуборде ❓\n' +
    '⠀\n' +
    'Может хочешь улучшить навык катания ❓\n' +
    '⠀\n' +
    '✔ Самое время записаться на индивидуальное занятие в ProRideSchool.\n' +
    '⠀\n' +
    'Опытные инструкторы в короткие сроки научат безопасной технике катания, ты вольешься в спортивное сообщество и укрепишь здоровье, занимаясь на свежем воздухе 🏔\n' +
    '⠀\n' +
    'Успей записаться до конца недели, ведь с 1 декабря цены вырастут!', 'Твое питание тебя убивает 😈\n' +
    '\n' +
    'Несбалансированное питание — бомба замедленного действия, которая наносит вред тебе и близким.\n' +
    '\n' +
    'Меня зовут Александра, и я спортивный тренер с 7-летним опытом работы, дипломированный нутрициолог и диетолог.\n' +
    '\n' +
    'В моем  блоге ты узнаешь:\n' +
    '\n' +
    '🔸Как сохранить здоровье и молодость.\n' +
    '🔸Как поменять пищевые привычки и не навредить себе.\n' +
    '🔸Что должно быть в продуктовой корзине.\n' +
    '🔸Почему соль — не белая смерть.\n' +
    '\n' +
    'Подпишись, и я изменю тебя в лучшую сторону.', 'Спорт, удобство, стиль на каждый день ❓\n' +
    '\n' +
    'Черные брюки для прогулок или занятий спортом, а может для встречи с друзьями или романтичного вечера? Решать тебе, но стильный образ точно сделает день лучше.\n' +
    '\n' +
    'Производитель: Турция\n' +
    'Состав: Полиэстер 63%, вискоза 33%, лайкра  4%\n' +
    'Больше вещей на сайте по ссылке в описании профиля'],
    'health': ['Какое оборудование выбрать новичку 😮\n' +
    '\n' +
    'Сезон начался, вы уже записались в группу или на занятие с тренером, вам уже не терпится начать кататься. Тут появляется вопрос, каким оборудованием пользоваться новичку❓\n' +
    '\n' +
    'Покупать профессиональное, брать в аренду, купить б/у, взять у друга.... Вариантов множество и большинство учеников теряется и не знает, как поступить.\n' +
    '\n' +
    'Мы хотим, чтобы вы были подготовлены и первые занятия прошли комфортно, поэтому ловите рекомендации от любимой школы 💜\n' +
    '\n' +
    '✔️ Обородувание для катания можно смело взять в прокате, НО.\n' +
    '\n' +
    '⛷️ Лыжные ботинки должны быть куплены, потому что от качества и удобства спортивной обуви зависит безопасность занятий. Ботинки должны идеально сидеть и подходить именно вам.\n' +
    '\n' +
    '❄️ Непромокаемые теплые штаны не взять в прокате, поэтому их лучше купить заранее. С ними вы сможете безопасно находиться на холоде долгое время и не заболеть после занятия.\n' +
    '\n' +
    '☃️ К мелочам, про которые забывают, относятся теплые перчатки и лыжные очки \n' +
    '\n' +
    '🌬️ Перчатки, как и штаны, обеспечивают комфорт на холоде. Лыжные очки предпочтительно иметь свои, чтобы не надевать на лицо грязный использованный инвентарь.\n' +
    '\n' +
    'Если пост оказался полезен, напишите в комментариях 🥰 ', 'Что делать, если ребенок отказывается идти на занятие 😲\n' +
    '\n' +
    'Бывает, что уже пора собираться на спорт, а ребенок заистерил и наотрез отказался идти на тренировку. Чаще всего родители либо насильно тащат его тренироваться, либо находятся в растерянности и задумываются об отмене занятий.\n' +
    '\n' +
    'Мы подготовили несколько советов, которые могут помочь разобраться в проблеме.\n' +
    '\n' +
    '🔹 Разговор.\n' +
    'Ребенок может говорить вам, что у него что-то болит, что он устал и.т.д. В таком случае подозревайте более серьезную причину прогула. Возможно, ребенка обижают, или в коллективе возник конфликт. Постарайтесь осторожно выяснить реальную причину. Задайте ребенку наводящие вопросы, но не будьте слишком навязчивы.\n' +
    '\n' +
    '🔸 Побудьте Шерлоком.\n' +
    'Незаметно понаблюдайте за ребенком какое-то время, может он не спит ночью или стал чаще утомляться? При жалобах на боль отведите ребенка к врачу, скорее всего ничего серьезного с ним не происходит, но в некоторых случаях на ранней стадии вы выявите проблемы со здоровьем.\n' +
    '\n' +
    '🔹Займите ребенка делом.\n' +
    'Пусть прогул не становится праздником, если ребенок остался дома. Займите его домашним заданием или дайте дополнительные материалы для изучения.\n' +
    '\n' +
    '🥰 Мы хотим, чтобы дети занимались в PRORIDESCHOOL с удовольствием. В случае любых проблем поговорите с тренером ребенка, ведь мы следим за каждым учеником.', 'Постоянство и результат 💥\n' +
    '⠀\n' +
    'При малейших изменениях, а иногда даже не добившись даже их, большинство расслабляются и портят проделанную работу 😭\n' +
    '⠀\n' +
    'Какие оправдания вы придумываете! Здоровье у многих не вписывается в распорядок дня 🙄\n' +
    '⠀\n' +
    'Я видела запущенные случаи, занятых людей, с болячками, проблемами, которые просто брали и ДЕЛАЛИ.\n' +
    '⠀\n' +
    'Ты не работаешь над телом не потому что тебе на самом деле это не надо. Тебе просто удобно думать, что и так норм. Поверь, это не так! Желание меняться будет съедать изнутри, и чем дольше ты не будешь слушать себя, тем сложнее будет из этого выбраться...\n' +
    '⠀\n' +
    'Уже месяц мир никуда не спешит. Стало понятно, кому действительно не хватало времени, а кому просто лень 👿\n' +
    '⠀\n' +
    'Только тебе нужно здоровье – опора на оставшуюся жизнь. Что заложится сейчас, будет поддержкой и силой в старости. Если ты еще на диване, поднимай ЖОПУ, иди работай над собой и выкинь каку из холодильника 🥐🥞🍝\n' +
    '⠀\n' +
    'Я всегда помогу, если что-то непонятно, но в этом не будет смысла, если ты продолжишь игнорировать здоровье ☝️\n' +
    '⠀\n' +
    'Признавайтесь, умудряетесь прогуливать домашние тренировки?']
}
const noDBPics = {
    'feedP': [/*'./images/image%2022.png', */'./images/image%2021.png', './images/image%2016.png', './images/image%2015.png', './images/image%2017.png', './images/image%2018.png',
        './images/Group%206.png', './images/image%2013.png',
        './images/image%2014.png'],
    'storiesP': ['./images/InShot_20191110_210221131.gif',
        './images/InShot_20200206_201438255.gif', './images/InShot_20191122_122957519.gif',
        './images/Storybeat-1582915682588.gif', './images/Storybeat-1584284491855.gif'],
    'content': ['./images/план1.png', './images/план2.png', './images/план3.png'],
    'rubrics': [['Диетолог', './images/рубриктор11.png', './images/рубриктор12.png'], ['Школа',
        './images/рубриктор21.png', './images/рубрикатор22.png']],
    'masks': ['./images/a24a566b-aa09-4750-8700-bf7ff28a82cb.gif', './images/88cf9aad-7902-4b39-ac4a-ab1ae6c5c4e2.gif', './images/VID_74620106_111311_593.gif',
         './images/36502dea-a1c3-48f7-b206-ed1dce882a5b.gif',
        './images/58ae8933-ce5d-47c5-9055-fd8b6752f818.gif', './images/VID_138840623_014825_843.gif',
        './images/049b2d1e-3935-4bc6-b8ca-3bb084ba6498.gif', './images/video_2020-06-02_13-24-38.gif']
}

function launch(){
    applyListeners();
    addTexts();
}

function applyListeners(){
    document.querySelectorAll('.contactButton').forEach(elem=>{
        elem.addEventListener('click', ()=>{
            document.querySelector('.shadow').style.display = 'block';
            document.querySelector('.popup').style.display = 'flex';
        })
    });

    document.querySelector('.popup__close').addEventListener('click',()=>{
        document.querySelector('.shadow').style.display = 'none';
        document.querySelector('.popup').style.display = 'none';
    });

    document.querySelectorAll('.texts').forEach(elem=> {
        elem.addEventListener('click', () => {
            const topic = elem.classList[3];
            if (elem.classList.contains('arrowPrev')){
                let newTextNum = parseInt(elem.parentNode.querySelector('.texts__examplesBlock').querySelectorAll('.exampleText')[0].getAttribute('textNum'))-1;
                if (newTextNum < 0){
                    newTextNum = noDBTexts[topic].length - 1;
                }
                const newBlock = buildNewText(topic, newTextNum, elem.parentNode.querySelector('.exampleText__coloredTop').classList[1]);
                elem.parentNode.querySelector('.texts__examplesBlock').removeChild(elem.parentNode.querySelector('.texts__examplesBlock').querySelectorAll('.exampleText')[2]);
                elem.parentNode.querySelector('.texts__examplesBlock').prepend(newBlock);
            }
            else if (elem.classList.contains('arrowNext')){
                let newTextNum = parseInt(elem.parentNode.querySelector('.texts__examplesBlock').querySelectorAll('.exampleText')[2].getAttribute('textNum'))+1;
                if (newTextNum === noDBTexts[topic].length){
                    newTextNum = 0;
                }
                const newBlock = buildNewText(topic, newTextNum, elem.parentNode.querySelector('.exampleText__coloredTop').classList[1]);
                elem.parentNode.querySelector('.texts__examplesBlock').removeChild(elem.parentNode.querySelector('.texts__examplesBlock').querySelectorAll('.exampleText')[0]);
                elem.parentNode.querySelector('.texts__examplesBlock').appendChild(newBlock);
            }
        })
    })

    document.querySelectorAll('.feedP').forEach(elem=> {
        elem.addEventListener('click', () => {
            if (elem.classList.contains('arrowPrev')) {
                let newFeedNum = parseInt(elem.parentNode.querySelector('.feed__exampleGrid').querySelectorAll('.feed__pics')[0].getAttribute('feedNum'))-1;
                console.log(newFeedNum);
                if (newFeedNum < 0){
                    newFeedNum = noDBPics.feedP.length - 1;
                }
                const newBlock = buildNewFeed(newFeedNum);
                elem.parentNode.querySelector('.feed__exampleGrid').removeChild(elem.parentNode.querySelector('.feed__exampleGrid').querySelectorAll('.feed__example')[2]);
                elem.parentNode.querySelector('.feed__exampleGrid').prepend(newBlock);
            }
            else if (elem.classList.contains('arrowNext')){
                let newFeedNum = parseInt(elem.parentNode.querySelector('.feed__exampleGrid').querySelectorAll('.feed__pics')[2].getAttribute('feedNum'))+1;
                if (newFeedNum === noDBPics.feedP.length){
                    newFeedNum = 0;
                }
                const newBlock = buildNewFeed(newFeedNum);
                elem.parentNode.querySelector('.feed__exampleGrid').removeChild(elem.parentNode.querySelector('.feed__exampleGrid').querySelectorAll('.feed__example')[0]);
                elem.parentNode.querySelector('.feed__exampleGrid').appendChild(newBlock);
            }
        });

    });

    document.querySelectorAll('.storiesP').forEach(elem=> {
        elem.addEventListener('click', () => {
            if (elem.classList.contains('arrowPrev')) {
                let newStoriesNum = parseInt(elem.parentNode.querySelector('.stories__exampleBlock').querySelectorAll('.stories__story')[0].getAttribute('storiesNum'))-1;
                if (newStoriesNum < 0){
                    newStoriesNum = noDBPics.storiesP.length - 1;
                }
                const newBlock = buildNewStories(newStoriesNum);
                elem.parentNode.querySelector('.stories__exampleBlock').removeChild(elem.parentNode.querySelector('.stories__exampleBlock').querySelectorAll('.stories__example')[3]);
                elem.parentNode.querySelector('.stories__exampleBlock').prepend(newBlock);
            }
            else if (elem.classList.contains('arrowNext')){
                let newStoriesNum = parseInt(elem.parentNode.querySelector('.stories__exampleBlock').querySelectorAll('.stories__story')[3].getAttribute('storiesNum'))+1;
                if (newStoriesNum === noDBPics.storiesP.length){
                    newStoriesNum = 0;
                }
                const newBlock = buildNewStories(newStoriesNum);
                elem.parentNode.querySelector('.stories__exampleBlock').removeChild(elem.parentNode.querySelector('.stories__exampleBlock').querySelectorAll('.stories__example')[0]);
                elem.parentNode.querySelector('.stories__exampleBlock').appendChild(newBlock);
            }
        });
    });

    document.querySelectorAll('.content').forEach(elem=> {
        elem.addEventListener('click', () => {
            if (elem.classList.contains('arrowPrev')) {
                let newPlanNum = parseInt(elem.parentNode.querySelector('.contentPlans__table').getAttribute('planNum'))-1;
                if (newPlanNum < 0){
                    newPlanNum = noDBPics.content.length - 1;
                }
                const newBlock = buildNewPlan(newPlanNum);
                elem.parentNode.querySelector('.contentPlans__example').removeChild(elem.parentNode.querySelector('.contentPlans__example').querySelector('.contentPlans__table'));
                elem.parentNode.querySelector('.contentPlans__example').appendChild(newBlock);
            } else if (elem.classList.contains('arrowNext')) {
                let newPlanNum = parseInt(elem.parentNode.querySelector('.contentPlans__table').getAttribute('planNum'))+1;
                if (newPlanNum === noDBPics.content.length){
                    newPlanNum = 0;
                }
                const newBlock = buildNewPlan(newPlanNum);
                elem.parentNode.querySelector('.contentPlans__example').removeChild(elem.parentNode.querySelector('.contentPlans__example').querySelector('.contentPlans__table'));
                elem.parentNode.querySelector('.contentPlans__example').appendChild(newBlock);
            }
        });
    });

    document.querySelectorAll('.rubrics').forEach(elem=> {
        elem.addEventListener('click', () => {
            if (elem.classList.contains('arrowPrev')) {
                let newRubricNum = parseInt(elem.parentNode.querySelector('.rubricBlock').getAttribute('rubricNum'))-1;
                if (newRubricNum < 0){
                    newRubricNum = noDBPics.rubrics.length - 1;
                }
                const newBlock = buildNewRubric(newRubricNum);
                elem.parentNode.querySelector('.storiesRubrics__example').removeChild(elem.parentNode.querySelector('.rubricBlock'));
                elem.parentNode.querySelector('.storiesRubrics__example').prepend(newBlock);
            }
            else if (elem.classList.contains('arrowNext')){
                let newRubricNum = parseInt(elem.parentNode.querySelector('.rubricBlock').getAttribute('rubricNum'))+1;
                if (newRubricNum === noDBPics.rubrics.length){
                    newRubricNum = 0;
                }
                const newBlock = buildNewRubric(newRubricNum);
                elem.parentNode.querySelector('.storiesRubrics__example').removeChild(elem.parentNode.querySelector('.rubricBlock'));
                elem.parentNode.querySelector('.storiesRubrics__example').appendChild(newBlock);
            }
        });
    });

    document.querySelectorAll('.masks').forEach(elem=> {
        elem.addEventListener('click', () => {
            if (elem.classList.contains('arrowPrev')) {
                let newMaskNum = parseInt(elem.parentNode.querySelector('.masks__exampleBlock').querySelectorAll('.masks__example')[0].getAttribute('masknum')) - 1;
                if (newMaskNum < 0) {
                    newMaskNum = noDBPics.masks.length - 1;
                }
                const newBlock = buildNewMask(newMaskNum);
                elem.parentNode.querySelector('.masks__exampleBlock').removeChild(elem.parentNode.querySelector('.masks__exampleBlock').querySelectorAll('.masks__example')[3]);
                elem.parentNode.querySelector('.masks__exampleBlock').prepend(newBlock);
            } else if (elem.classList.contains('arrowNext')) {
                let newMaskNum = parseInt(elem.parentNode.querySelector('.masks__exampleBlock').querySelectorAll('.masks__example')[3].getAttribute('masknum')) + 1;
                if (newMaskNum === noDBPics.masks.length) {
                    newMaskNum = 0;
                }
                const newBlock = buildNewMask(newMaskNum);
                elem.parentNode.querySelector('.masks__exampleBlock').removeChild(elem.parentNode.querySelector('.masks__exampleBlock').querySelectorAll('.masks__example')[0]);
                elem.parentNode.querySelector('.masks__exampleBlock').appendChild(newBlock);
            }
        });
    });

    document.querySelectorAll('.popup__input').forEach(elem=>{
        elem.addEventListener('input', ()=>{
            if (document.querySelectorAll('.popup__input')[0].value.length > 1 && document.querySelectorAll('.popup__input')[1].value.length >= 11 && document.querySelectorAll('.popup__input')[1].value.length <= 16){
                document.querySelector('.mailButton').removeAttribute('disabled');
            }
            else {
                document.querySelector('.mailButton').setAttribute('disabled', '');
            }
        })
    })

    document.querySelector('.mailButton').addEventListener('click',(event)=>{
        event.preventDefault();
        const data = document.querySelectorAll('.popup__input');
        console.log(data);
        emailjs.send("mail_ru", "main", {"user_name": data[0].value,"user_email": data[1].value})
            .then(()=>alert("Ваша заявка принята, спасибо!"))
            .catch(()=>alert("Что-то пошло не так (｡•́︿•̀｡)"));
        document.querySelector('.shadow').style.display = 'none';
        document.querySelector('.popup').style.display = 'none';
    })

    document.querySelectorAll('.texts__li').forEach((elem, index)=>{
        elem.addEventListener('click', ()=>{
            window.scrollTo(0,window.scrollY+document.querySelectorAll('.texts__example')[index].getBoundingClientRect()['y']);
        })
    })
}


function addTexts(){
    let keyCounter = 0;
    document.querySelectorAll('.texts__example').forEach(elem=>{
        let valueCounter = 0;
        elem.querySelectorAll('.exampleText').forEach((textBox)=>{
            textBox.querySelector('.exampleText__text').innerText = noDBTexts[Object.keys(noDBTexts)[keyCounter]][valueCounter];
            textBox.setAttribute('textNum', valueCounter);
            valueCounter+=1;
        });
        valueCounter = 0;
        keyCounter += 1;
    })
}

function buildNewMask(newMaskNum){
    const newData = noDBPics.masks[newMaskNum];
    const newBlock = document.createElement('div');
    newBlock.classList.add('masks__example');
    newBlock.setAttribute('maskNum', newMaskNum);
    newBlock.innerHTML = `<div class="exampleText__coloredTop exampleText__coloredTop_orange"></div>
                        <img class="masks__mask" alt="" src=${newData}>`;
    return newBlock;
}

function buildNewRubric(newRubricNum){
    const newData = noDBPics.rubrics[newRubricNum];
    const newBlock = document.createElement('div');
    newBlock.classList.add('rubricBlock');
    newBlock.setAttribute('rubricNum', newRubricNum);
    newBlock.innerHTML = `<h2 class="rubricBlock__header">${newData[0]}</h2>
                    <div class="rubricBlock__contentBlock">
                        <img src= ${newData[1]} alt="" class="rubricBlock__pic">
                        <img src= ${newData[2]} alt="" class="rubricBlock__pic">
                    </div>`;
    return newBlock;
}

function buildNewPlan(newPlanNum){
    const newPic = noDBPics.content[newPlanNum];
    const newBlock = document.createElement('img');
    newBlock.classList.add('contentPlans__table');
    newBlock.setAttribute('alt', '');
    newBlock.setAttribute('src', newPic);
    newBlock.setAttribute('planNum', newPlanNum);
    return newBlock;
}

function buildNewStories(newStoriesNum){
    const newPic = noDBPics.storiesP[newStoriesNum];
    const newBlock = document.createElement('div');
    newBlock.classList.add('stories__example');
    newBlock.innerHTML = `<div class="exampleText__coloredTop exampleText__coloredTop_orange"></div>
                            <img storiesNum = ${newStoriesNum.toString()} class="stories__story" alt="" src=${newPic}>`;
    return newBlock;
}

function buildNewFeed(newFeedNum){
    const newPic = noDBPics.feedP[newFeedNum];
    const newBlock = document.createElement('div');
    newBlock.classList.add('feed__example');
    newBlock.innerHTML = `<div class="exampleText__coloredTop exampleText__coloredTop_orange"></div>
                            <img feedNum = ${newFeedNum.toString()} class="feed__pics" alt="" src=${newPic}>`;
    return newBlock;
}

function buildNewText(topic, newTextNum, color){
    const newText = noDBTexts[topic][newTextNum];
    const newBlock = document.createElement('div');
    newBlock.classList.add('exampleText');
    newBlock.setAttribute('textNum', newTextNum.toString());
    const coloredTop = document.createElement('div');
    coloredTop.classList.add('exampleText__coloredTop');
    coloredTop.classList.add(color);
    const exampleText = document.createElement('p');
    exampleText.classList.add('exampleText__text');
    exampleText.innerText = newText;
    newBlock.appendChild(coloredTop);
    newBlock.appendChild(exampleText);
    return newBlock;
}

launch();